Page.create(body: <<-'EOS'
# Agile • Rails • Cloud

- **なるべく早く動くものを作り上げる手法**
- **作ったものを容易に変更できる環境**

## 早期に導入効果を実現
アジャイル開発は、2週間から1ヶ月程度の短い期間で開発プロセスを繰り返します。数回の反復を繰り返して、お客様は早期に運用を開始することができますので、競合他社よりも早くビジネス価値を実現でき、かつ投資したコストを早期に回収できます。

## スピーディな仮説検証サイクル
プロジェクト初期の段階では必ずしもすべての要件は明確ではありません。また、要件は多様化・複雑化し、移り変わりも激しく、作成したソフトウェアは陳腐化していきます。これに対して、お客様は、必要なものから順番に、かつ短いサイクルで、仮説を検証していくことができます。

## 要件全てを確定させずに、柔軟に軌道修正
プロジェクトの最初に全ての要件を決め、計画に従って開発を行うウォーターフォール型と呼ばれる開発モデルに対して、アジャイル開発では、変化を受け入れ、柔軟に軌道修正していく方式をとります。弊社では、Agile • Rails • Cloud の組み合わせでアジャイル開発の理想を実現します。

## 低コストで本番環境と開発環境を構築
Ruby on Rails は「同じことを繰り返さない」「設定より規約」という基本理念があり、コンポーネントの統合は手動での設定を必要とせず、自動で規約に従い行われます。アプリケーションはシンプルな構成であるため、保守性が高く、障害発生時にも問題箇所をすばやく特定できます。

## 運用および保守費用の低減
Rails はテストのフレームワークが標準で装備されていますので、プロジェクトの開始時点からテストを自動化して、継続的に品質を検証することができます。さらに、クラウドへのアプリケーションの配備を自動化することで、継続的にアプリケーションをデリバリーすることができます。

# お問い合わせ
- [株式会社テイジイエル](http://www.tgl.co.jp)
- http://www.tgl.co.jp
            EOS
           )
